Repository: WordPress/HelpHub
Catalog: plugins/support-helphub/inc/syntaxhighlighter/localization/syntaxhighlighter-*.po
Languages: de_de

source: Default
de_de: Standard

source: [None]
de_de: [ohne]

source: SyntaxHighlighter Settings
de_de: SyntaxHighlighter Einstellungen

source: Settings
de_de: Einstellungen

source: show source
de_de: Quelltext aufklappen

source: view source
de_de: Quelltext anzeigen

source: copy to clipboard
de_de: In die Zwischenablage kopieren

source: The code is in your clipboard now
de_de: Der Quelltext wurde in die Zwischenablage kopiert

source: print
de_de: Drucken

source: Can't find brush for:
de_de: Keine Syntax-Datei vorhanden für:

source: Brush wasn't configured for html-script option:
de_de: Die Syntax-Datei ist nicht für die „htmlscript” Option konfiguriert:

source: + expand source
de_de: + Quelltext aufklappen

source: Are you sure you want to reset your settings to the defaults?
de_de: Bist du sicher, dass du alle Einstellungen zurücksetzen willst?

source: Settings reset to defaults.
de_de: Alle Einstellungen wurden zurückgesetzt.

source: Version 3 allows visitors to easily highlight portions of your code with their mouse (either by dragging or double-clicking) and copy it to their clipboard. No toolbar containing a Flash-based button is required.
de_de: <p class="description">In Version 3.x können Teile des Quelltextes mit der Maus markiert und in die Zwischenablage kopiert werden, ohne dass Adobe Flash benötigt wird.<br> In Version 2.x können lange Zeilen mittels Zeilenumbruch angezeigt werden.</p>

source: Color Theme
de_de: Farbschema

source: Load All Brushes
de_de: Alle Syntax-Dateien laden

source: Always load all language files (for directly using <code>&lt;pre&gt;</code> tags rather than shortcodes)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If left unchecked (default), then language files will only be loaded when needed<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If unsure, leave this box unchecked
de_de: Immer alle Syntax-Dateien laden, um <code>&lt;pre&gt;</code> Tags anstelle von Shortcodes verwenden zu können.<p class="description">Wenn diese Option deaktiviert ist, werden die Syntax-Dateien nur bei Bedarf geladen (Voreinstellung). Im Zweifel solltest du diese Option deaktiviert lassen.</p>

source: Defaults
de_de: Voreinstellungen

source: All of the settings below can be configured on a per-code block basis, but you can control the defaults of all code blocks here.
de_de: Alle folgenden Einstellungen können mit den unten beschriebenen Shortcode Parametern pro Quelltext-Block festgelegt werden. Du kannst hier aber die Voreinstellungen für alle Quellcode-Blöcke festlegen.

source: Miscellaneous
de_de: Allgemein

source: Display line numbers
de_de: <code>gutter</code> &#8212; Zeilennummern anzeigen

source: Display the toolbar
de_de: <code>toolbar</code> &#8212; Toolbar anzeigen

source: Automatically make URLs clickable
de_de: <code>autolinks</code> &#8212; URLs im Quelltext als Link darstellen

source: Collapse code boxes
de_de: <code>collapse</code> &#8212; Quelltext-Block zugeklappt anzeigen

source: Use the light display mode, best for single lines of code
de_de: <code>light</code> &#8212; Keine Zeilennummern und kein Toolbar anzeigen

source: Use smart tabs allowing tabs being used for alignment
de_de: <code>smarttabs</code> &#8212; Tabstopps zur Ausrichtung verwenden

source: Wrap long lines (v2.x only, disabling this will make a scrollbar show instead)
de_de: <code>wraplines</code> &#8212; Zu lange Zeilen mittels Zeilenumbruch statt einer Bildlaufleiste darstellen (nur in Version 2.x möglich)

source: Enable &quot;HTML script&quot; mode by default (see the bottom of this page for details). Checking this box is not recommended as this mode only works with certain languages.
de_de: <code>htmlscript</code> &#8212; HTML/XML innerhalb des Quelltextes hervorheben. Es wird nicht empfohlen, diesen Modus als Voreinstellung zu verwenden, da er nur bei bestimmten Programmiersprachen verfügbar ist.

source: Additional CSS Class(es)
de_de: Zusätzliche CSS Klasse(n)

source: Starting Line Number
de_de: Erste Zeilennummer

source: Line Number Padding
de_de: Führende Nullen anzeigen

source: Off
de_de: Keine

source: Automatic
de_de: Automatisch

source: Tab Size
de_de: Tabulatorbreite

source: Title
de_de: Überschrift

source: Some optional default text to display above each code block or as the clickable text for collapsed code blocks.
de_de: <p class="description">Überschrift für den Quelltext (nur in Version 3.x möglich)</p>

source: Reset to Defaults
de_de: Alle Einstellungen zurücksetzen

source: Save Changes
de_de: Änderungen speichern

source: Preview
de_de: Vorschau

source: Click &quot;Save Changes&quot; to update this preview.
de_de: Klicke „Änderungen speichern” zur Aktualisierung der Vorschau.

source: PHP Code Example
de_de: PHP Quelltext Beispiel

source: Hello World!
de_de: Hallo Welt!

source: This line is highlighted.
de_de: Diese Zeile ist hervorgehoben.

source: This is an example of smart tabs.
de_de: Dies ist ein Beispiel für Smart Tabs.

source: Shortcode Parameters
de_de: Shortcodes

source: These are the parameters you can pass to the shortcode and what they do. For the booleans (i.e. on/off), pass %1$s/%2$s or %3$s/%4$s.
de_de: Liste der Shortcode Parameter und ihrer Funktion. Für boolesche Werte (d.h. an/aus), verwende %1$s/%2$s oder %3$s/%4$s.

# language parameter
source: %1$s or %2$s &#8212; The language syntax to highlight with. You can alternately just use that as the tag, such as <code>[php]code[/php]</code>. <a href="%3$s">Click here</a> for a list of valid tags (under &quot;aliases&quot;).
de_de: %1$s oder %2$s &#8212; Programmiersprache des Quelltextes festlegen. Du kannst alternativ auch nur den Namen der Programmiersprache als Tag verwenden. Beispiel: <code>[php]code[/php]</code>. Eine Liste der gültigen Tags findest du auf <a href="%3$s">dieser Seite</a> unter dem Navigationspunkt <a href="http://alexgorbatchev.com/SyntaxHighlighter/manual/brushes/">syntaxes</a>.

# autolinks parameter
source: %s &#8212; Toggle automatic URL linking.
de_de: %s &#8212; URLs im Quelltext als Link darstellen.

# classname parameter
source: %s &#8212; Add an additional CSS class to the code box.
de_de: %s &#8212; Zusätzliche CSS Klasse(n) für den Quelltext-Block einbinden. Mehrere Klassen durch Leerzeichen voneinander trennen.

# collapse parameter
source: %s &#8212; Toggle collapsing the code box by default, requiring a click to expand it. Good for large code posts.
de_de: %s &#8212; Quelltext-Block zugeklappt anzeigen. Zum Aufklappen ist dann ein Klick auf den Quelltext-Block notwendig. Diese Einstellung eignet sich insbesondere für längere Quelltexte.

# firstline parameter
source: %s &#8212; An interger specifying what number the first line should be (for the line numbering).
de_de: %s &#8212; Erste Zeilennummer für die Nummerierung der Quelltextzeilen festlegen.

# gutter parameter
source: %s &#8212; Toggle the left-side line numbering.
de_de: %s &#8212; Zeilennummern anzeigen.

# highlight parameter
source: %1$s &#8212; A comma-sperated list of line numbers to highlight. You can also specify a range. Example: %2$s
de_de: %1$s &#8212; Quelltextzeilen hervorheben. Die Angabe erfolgt in Form einer kommaseparierten Liste oder eines Bereichs: %2$s

# htmlscript parameter
source: %s &#8212; Toggle highlighting any extra HTML/XML. Good for when you're mixing HTML/XML with another language, such as having PHP inside an HTML web page. The above preview has it enabled for example. This only works with certain languages.
de_de: %s &#8212; HTML/XML innerhalb des Quelltextes hervorheben. Diese Option ist geeignet, wenn HTML/XML und eine andere Sprache gemischt werden (z.B. PHP innerhalb einer HTML Webseite in der obigen Vorschau). Diese Option ist jedoch nur für bestimmte Programmiersprachen verfügbar.

# light parameter
source: %s &#8212; Toggle light mode which disables the gutter and toolbar all at once.
de_de: %s &#8212; Keine Zeilennummern und kein Toolbar anzeigen.

# padlinenumbers parameter
source: %s &#8212; Controls line number padding. Valid values are <code>false</code> (no padding), <code>true</code> (automatic padding), or an integer (forced padding).
de_de: %s &#8212; Führenden Nullen anzeigen. Gültige Werte sind <code>false</code> (keine führenden Nullen), <code>true</code> (automatische Anzahl führender Nullen) oder ein Integer Wert (feste Anzahl von Stellen).

# title parameter
source: %1$s (v3 only) &#8212; Sets some text to show up before the code. Very useful when combined with the %2$s parameter.
de_de: %1$s (nur Version 3.x) &#8212; Überschrift für den Quelltext. Diese Option empfiehlt sich, wenn %2$s verwendet wird.

# toolbar parameter
source: %s &#8212; Toggle the toolbar (buttons in v2, the about question mark in v3)
de_de: %s &#8212; Toolbar anzeigen.

# wraplines parameter
source: %s (v2 only) &#8212; Toggle line wrapping.
de_de: %s (nur Version 2.x) &#8212; Zu lange Zeilen mittels Zeilenumbruch statt einer Bildlaufleiste darstellen.

source: Some example shortcodes:
de_de: Einige Beispiele für Shortcodes:

source: your code here
de_de: Hier steht der Quelltext

source: example-filename.php
de_de: beispieldatei.php
