Repository: WordPress/HelpHub
Catalog: plugins/syntaxhighlighter/localization/syntaxhighlighter-*.po
Languages: tr_tr, uk

source: Default
tr_tr: Varsayılan
uk: По замовчуванню

source: Fade to Grey
tr_tr: Gri
uk: З переходом в сірий

source: Midnight
tr_tr: Gece Yarısı
uk: Північ

source: [None]
tr_tr: Hiçbiri
uk: Жодного

source: SyntaxHighlighter Settings
tr_tr: SyntaxHighlighter Ayarlari
uk: Налаштування SyntaxHighlighter

source: Settings
uk: Налаштування

source: show source
uk: показати код

source: view source
tr_tr: kaynağı göster
uk: дивитись код

source: copy to clipboard
tr_tr: panoya kopyala
uk: скопіювати у буфер

source: The code is in your clipboard now
tr_tr: Simdi panoya kopyalandi.
uk: Код скопійовано у буфер

source: print
tr_tr: yazdır
uk: друк

source: Can't find brush for:
tr_tr: Fırça bulunamadı :
uk: Не можу знайти "кольорову схему" для:

source: Brush wasn't configured for html-script option:
tr_tr: Firça Html-script seçenegi için yapilandirilmis degil:
uk: "Кольорова схема" не налаштована для опції html-script

source: Are you sure you want to reset your settings to the defaults?
tr_tr: Varsayilan ayarlara geri dönmek istediginize emin misiniz ?
uk: Ви впевнені, що хочете повернутися до стандартних налаштувань?

source: Settings reset to defaults.
tr_tr: Varsayilan ayarlara dön.
uk: Налаштування зкинуті до стандартних

source: Color Theme
tr_tr: Tema rengi
uk: Кольорова схема

source: Defaults
tr_tr: Varsayılan
uk: За замовчуванням

source: All of the settings below can be configured on a per-code box basis, but you can control the defaults of all code boxes here.
uk: Усі налаштування можуть бути сконфігуровані при використанні коротких кодів, але Ви можете також зробити налаштування для усіх блоків коду тут

source: Miscellaneous
tr_tr: Çeşitli Ayarlar
uk: Інше

source: Display line numbers
tr_tr: Satir numaralarini göster.
uk: Показувати номери рядків

source: Display the toolbar
tr_tr: Araç çubugunu göster
uk: Показувати панель інструментів

source: Automatically make URLs clickable
tr_tr: Url'leri otomatik tiklanabilir yap
uk: Робити лінки клікабельними

source: Collapse code boxes
tr_tr: Kod kutusunu daralt
uk: Звертати блоки коду

source: Use the light display mode, best for single lines of code
tr_tr: En iyi tek satir için aydinlatma modunu kullan.
uk: Використовувати "легкий" вигляд (добре для однорядкового коду)

source: Use smart tabs allowing tabs being used for alignment
tr_tr: Hizalama için akilli sekmeleri kullan.
uk: Використовувати закладки

source: Wrap long lines (disabling this will make a scrollbar show instead)
uk: Переносити слова у довгих рядках

source: Enable &quot;HTML script&quot; mode by default (see the bottom of this page for details). Checking this box is not recommended as this mode only works with certain languages.
uk: Активувати &quot;HTML script&quot; режим по замовчуванню (деталі внизу сторінки). Не рекомендується відмічати цю опцію, в цьому режимі плагін працює лише з декількома мовами.

source: Additional CSS Class(es)
tr_tr: Ek CSS Sinif(lar)i
uk: Додаткові класи CSS

source: Starting Line Number
tr_tr: Satir baslama numarasi
uk: Початковий номер рядка

source: Line Number Padding
uk: Відступ в номерах рядків

source: Load All Brushes
uk: Підгружати усі стилі

source: Always load all language files (for directly using <code>&lt;pre&gt;</code> tags rather than shortcodes)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If left unchecked (default), then language files will only be loaded when needed
uk: Завжди завантажувати усі файли мов для підсвітки (для використання з тегом <code>&lt;pre&gt;</code> замість використання коротких кодів)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Якщо не вмикати(по замовчуванню), тоді файли будуть підгружатись тільки при потребі

source: Off
uk: Вимкнути

source: Automatic
uk: Автоматично

source: Tab Size
tr_tr: Sekme Boyutu
uk: Розмір закладки

source: Save Changes
tr_tr: Degisiklikleri kaydet
uk: Зберегти зміни

source: Reset to Defaults
tr_tr: Varsayilan ayarlara dön
uk: Відновати початкові налаштування

source: Preview
tr_tr: Önizleme
uk: Прев'ю

source: Click &quot;Save Changes&quot; to update this preview.
tr_tr: Önizlemeyi güncellemek için &quot;Degisiklikleri Kaydet&quot; tiklayin
uk: Натисніть &quot;Зберегти зміни&quot; аби оновити прев'ю, що наведене нижче.

source: PHP Code Example
uk: Приклад PHP коду

source: Hello World!
uk: Привіт світ!

source: This line is highlighted.
uk: Цей рядок підсвічений

source: Shortcode Parameters
tr_tr: Kisakod parametreleri
uk: Параметри коротких кодів

source: These are the parameters you can pass to the shortcode and what they do. For the booleans (i.e. on/off), pass %1$s/%2$s or %3$s/%4$s.
tr_tr: Asağıdakı parametreleri uygulamak istediginiz yerde girebilirsiniz. (i.e. on/off), pass %1$s/%2$s or %3$s/%4$s.
uk: Параметри, які Ви можете використати у коротких кодах, та їх призначення. Для логічних параметрів (як увімкнути/вимкнути), використовується %1$s/%2$s або %3$s/%4$s.

source: %1$s or %2$s &#8212; The language syntax to highlight with. You can alternately just use that as the tag, such as <code>[php]code[/php]</code>. <a href="%3$s">Click here</a> for a list of valid tags (under &quot;aliases&quot;).
tr_tr: %1$s or %2$s &#8212; Dili sözdizimi ile vurgulamak için. Alternatif olarak bu etiketi kullanabilrsiniz, örneğin <code>[php]code[/php]</code>. <a href="%3$s">Tıkla</a> geçerli etiketlerin listesi için ( &quot;aliases&quot; altında).
uk: 1%s або %2$s &#8212; Мова, синтаксис якої потрібно підсвічувати. Можете скористатись тегом, наприклад, <code>[php]code[/php]</code>. Для перегляду усіх варіантів <a href="%3$s">натисніть тут</a>

source: %s &#8212; Toggle automatic URL linking.
tr_tr: %s &#8212; Geçiş için otomatik URL bağlantısı.
uk: %s &#8212; Дозволяє увімкнути чи вимкнути "активність" лінків (автоматичо робить лінки "клікабельними"). По замовчуванню - увімкнено.

source: %s &#8212; Add an additional CSS class to the code box.
tr_tr: %s &#8212; Kod kutusunu ek bir CSS sınıf eklemek.
uk: %s &#8212; Додати додатковий клас CSS до блоку з кодом

source: %s &#8212; Toggle collapsing the code box by default, requiring a click to expand it. Good for large code posts.
tr_tr: %s &#8212; Kod kutusunu daraltın, büyültmek için tıklama gerekir. Uzun kodlar için kullanışlı.
uk: %s &#8212; Дозволяє увімкнути чи вимкнути показ блоку у зверненому вигляді. Якщо увімкнете, блок буде прихованим.

source: %s &#8212; An interger specifying what number the first line should be (for the line numbering).
tr_tr: %s &#8212; Satir numarasinin ne olacağna dair bir tamsayi.
uk: %s &#8212; Вкажіть число, починаючи з якого нумерувати рядки

source: %s &#8212; Toggle the left-side line numbering.
tr_tr: %s &#8212; Sol tarafı satır numaralama.
uk: %s &#8212; Дозволяє увімкнути чи вимкнути нумерацію рядків.

source: %s &#8212; A comma-sperated list of line numbers to highlight.
tr_tr: %s &#8212; Virgülle ayrilmiş listelerin satir numaralarını vurgulamak.
uk: %s &#8212; Список номерів рядків через кому, які треба "підсвітити"

source: %s &#8212; Toggle highlighting any extra HTML/XML. Good for when you're mixing HTML/XML with another language, such as having PHP inside an HTML web page. The above preview has it enabled for example. This only works with certain languages.
uk: %s &#8212; Дозволяє увімкнути чи вимкнути підсвітку HTML/XML коду. Наприклад корисно, коли Ви публікуєте змішаний код ( HTML/XML та PHP, чи інш.) Працює з обмеженою кількістю мов.

source: %s &#8212; Toggle light mode which disables the gutter and toolbar all at once.
uk: %s &#8212; Дозволяє увімкнути чи вимкнути полегшену версію блоку з кодом (без нумерації рядків та панелі інструментів)

source: %s &#8212; Controls line number padding. Valid values are <code>false</code> (no padding), <code>true</code> (automatic padding), or an integer (forced padding).
uk: %s &#8212; Контролює відступ в номерах рядків. Може приймати значення <code>false</code> (без відступів), <code>true</code> (з автоматичними відступами) або число (примусовий відступ на Х знаків).

source: %s &#8212; Toggle the toolbar containing the helpful buttons.
tr_tr: %s &#8212; Geçiş yapmak için araç çubuğu içeren yararlı düğmeler.
uk: %s &#8212; Дозволяє увімкнути чи вимкнути панель інструментів з корисними кнопками

source: %s &#8212; Toggle line wrapping.
uk: %s &#8212; Дозволяє увімкнути чи вимкнути перенесення слів в довгих рядках коду.

source: Some example shortcodes:
tr_tr: Bazı örnek kodlar:
uk: декілька коротких кодів для прикладу

source: your code here
tr_tr: kod buraya
uk: ваш код тут

source: Easily post syntax-highlighted code to your site without having to modify the code at all. Uses Alex Gorbatchev's <a href="http://alexgorbatchev.com/wiki/SyntaxHighlighter">SyntaxHighlighter</a> v2.0.320 and some code by <a href="http://wordpress.com/">Andrew Ozz of Automattic</a>.
uk: Легко підсвічує код на Вашому сайті за допомогою коротких кодів. Використовує <a href="http://alexgorbatchev.com/wiki/SyntaxHighlighter">SyntaxHighlighter</a> v2.0.320 від Alex Gorbatchev та деякі доробки від <a href="http://wordpress.com/">Andrew Ozz з Automattic</a>.

source: Django
tr_tr: Avakado Yeşili

source: Emacs
tr_tr: Siyah

source: RDark
tr_tr: Prusya Mavisi

source: expand source
tr_tr: kaynağı genişlet

source: All of the settings below can also be configured on a per-code box basis.
tr_tr: Asagidaki tüm ayarlar "tik" isareti konularak yapilandirilabilir.

source: Show a ruler column along the top of the code box
tr_tr: Sütun için cetveli görüntüle

source: Font Size (Percentage)
tr_tr: Yazi boyutu (Yüzde olarak)

source: %s &#8212; Toggle highlighting any extra HTML/XML. Good for when you're mixing HTML/XML with another language, such as having PHP inside an HTML web page. The above preview has it enabled for example.
tr_tr: %s &#8212; extra html/xml leri vurgulamak için, Html/Xml leri bir başka dil ile karışık kullandığınzda iyidir. Örneğin, PHp'nin HTML sayfasinda kullanmak gibi. Yukardaki önizleme buna bir örnektir.

source: %s &#8212; Toggle light mode which disables the gutter, toolbar, and ruler all at once.
tr_tr: %s &#8212; Numaranladırmayı, araç çubuğuınu, cetveli bir seferde kaldıran sade mod.

source: %s &#8212; Toggle the column ruler at the top of the code box.
tr_tr: %s &#8212; Kodu kutusunun üstündeki sütun cetveli aktifleştir.

source: Cheatin&#8217; uh?
tr_tr: Hile ha ?

source: Easily post code to your blog while still maintaining complete control over it's display. Uses Alex Gorbatchev's <a href="http://code.google.com/p/syntaxhighlighter/">SyntaxHighlighter</a> and code by <a href="http://automattic.com/">Automattic</a>.
tr_tr: %s &#8212; extra html/xml leri vurgulamak için. Html/Xml leri bir başka dil ile karışık kullandığınzda iyidir. Örneğin, PHp'nin HTML sayfasinda kullanmak gibi. Yukardaki önizleme buna bir örnektir.
